{
  "recipes": [
    {
      "id": "Mint-Chocolate-Cheesecake",
      "name": "Mint Chocolate Cheesecake",
      "img": ["https://source.unsplash.com/Ao09kk2ovB0/1600x900"],
      "prepTime": "20",
      "cookTime": "35",
      "serves": "16",
      "difficulty": "Medium",
      "ingrnumber": "10",
      "ingredients": "for the crust egg, butter \\n\\nfor the filling: 8 ounces semisweet chocolate, finely chopped 8 ounces cream cheese, at room temperature 1 1/3 cups sugar, divided 1 1/2 cups sour cream, divided 2 large eggs, at room temperature 1/4 cup white creme de menthe (see Cook's Note ) 3 drops natural green food coloring, optional Chocolate curls, for garnish",
      "keywords": "Chocolate,Butter, Sugar, Cheese, Cream, Christmas, New Year's Eve, American, Baked",
      "category": "sweets",
      "description": "For the crust: Preheat oven to 175°C. Spray an 8-inch square metal baking pan with nonstick spray and line with foil.\\n\\n Pulse the cookies in a food processor with the butter, sugar, and salt to make a fine crust. Evenly press the crust into the prepared pan taking care to cover the bottom completely. Bake until the crust sets, about 15 minutes.\\n\\n Meanwhile, make the filling: Put the chocolate in a medium microwave-safe bowl; heat at 75 percent power until softened, about 2 minutes. Stir, and continue to microwave until completely melted, up to 2 minutes more. (Alternatively put the chocolate in a heatproof bowl. Bring a saucepan filled with an inch or so of water to a very slow simmer; set the bowl over, but not touching, the water, and stir occasionally until melted and smooth.) Blend the cream cheese, 2/3 cup of the sugar, and 1/2 cup of the sour cream together in the food processor until smooth.\\n\\n Scrape down the sides, as needed. Add the eggs and melted chocolate then pulse until just incorporated and smooth. Pour the filling evenly over the crust and bake until the filling puffs slightly around the edges and just set in the center, about 20 minutes.\\n\\n Mix the remaining cup of sour cream and 2/3 cup sugar with the creme de menthe and food coloring, if using. Carefully, spoon the mixture over the top of the chocolate and gently spread into an even layer. Bake until topping becomes glossy but is still a bit loose, about 15 minutes more. (The topping will set when cooled.) Cool on a rack. Cover and refrigerate for at least 2 hours or overnight.\\n\\n Lift cheesecake out of the pan, cut into 2-inch squares, and top with chocolate curls.\\n\\n Cook's Note: We prefer the delicate natural flavour of white creme de menthe versus the green."
    },
    {
      "id": "Sticky-Toffee-Pudding",
      "name": "Sticky-Toffee Pudding",
      "img": ["https://source.unsplash.com/HwR77Ugj7Q0/1600x900"],
      "prepTime": "10",
      "cookTime": "10",
      "serves": "8",
      "difficulty": "Easy",
      "ingrnumber": "10",
      "ingredients": "for the pudding: 1 1/2 cups pitted dates, chopped small (about 8 ounces), 1/2 cup whole milk, 1/2 teaspoon baking soda, 1 1/4 cups plain flour, 1 1/2 teaspoons baking powder, 1/2 teaspoon salt, 1/4 teaspoon mixed spice, 1 cup packed light brown sugar, 1 stick (8 tablespoons) unsalted butter, melted, 2 large eggs, Zest from 1 orange (about 1 1/2 teaspoons), Cooking spray\\n\\n for the sauce: 1 cup light brown sugar, 1 cup double cream, 1/4 cup unsalted butter, 1/8 teaspoon freshly grated nutmeg, Vanilla ice cream or whipped cream, for serving",

      "keywords": "Date, Milk, Flour, Spice, Sugar, Orange, Christmas, Sunday Lunch, New Year's Eve, Halloween, Boxing Day",
      "category": "fish",
      "description": "For the pudding: Bring the dates and milk to a simmer in a small saucepan over medium heat, and simmer until the dates begin to soften, 3 to 4 minutes. Remove from the heat, and stir in the baking soda (it will foam a bit); set aside to cool slightly.\\n\\n Whisk together the flour, baking powder, salt and pumpkin pie spice in a medium bowl until combined; set aside.\\n\\n Whisk together the sugar, butter, eggs and zest in a large bowl until smooth. Whisk in the date mixture until just combined. Stir in the flour mixture until just combined.\\n\\n Line the insert of a 6-quart slow cooker with a double layer of aluminum foil, pressing it smoothly into the corners, and spray well with cooking spray. Pour the batter into the foil, and turn the cooker on low for 4 hours. Fold a double layer of paper towels, and place just under the lid across the pot to absorb the excess moisture and form a tight seal. Cover tightly with the lid. Cook until the middle of the cake has set and a toothpick inserted in the center comes out clean. Let cool slightly, 15 to 20 minutes.\\n\\n For the sauce: While the pudding cools, bring the sugar, cream and butter to a boil in a small saucepan over medium-high heat; cook, stirring often, until smooth, about 5 minutes. Remove from the heat, and add the nutmeg.\\n\\n To assemble: Poke holes in the cake with a skewer, and pour half the toffee sauce over it. Let the cake cool, 10 to 15 minutes. Serve with ice cream or whipped cream.\\n\\n Copyright 2014 Television Food Network, G.P. All rights reserved."
    },
    {
      "id": "Parmigiano-Reggiano-Risotto",
      "name": "Parmigiano Reggiano Risotto",
      "img": ["https://source.unsplash.com/VNu0yM4kFdA/1600x900"],
      "prepTime": "20",
      "cookTime": "50",
      "serves": "4",
      "difficulty": "Easy",
      "ingrnumber": "10",
      "ingredients": "2 Vegetable stock cubes, 1 Bay leaf, 1 tbsp. Olive oil, 15g Butter, 300g Risotto rice (Arborio or carnaroli), 200g Butternut squash (weighed when prepared), chopped into 1cm cubes, 200ml Dry white wine, 1 Bunch spring onions, chopped, 100g Fine asparagus, trimmed and chopped, 100g Parmigiano Reggiano, finely grated, Salt and freshly ground black pepper, Parmigiano Reggiano shavings and basil leaves, to garnish",
      "keywords": "Parmigiano Reggiano Branded",
      "category": "vegan",
      "description": "Prepare the stock. Pour 1 litre boiling water into a saucepan. Crumble in the stock cubes. Add the bay leaf and simmer for 10 minutes.\\n\\n In a large frying pan or flameproof casserole dish, heat the olive oil and butter. Add the rice and butternut squash sauté gently over a low heat, stirring often, until the rice looks translucent. This will take about 3-4 minutes. Keep an eye on it and don’t allow it to brown.\\n\\n Pour the white wine into the rice, tipping it all in at once. Let it bubble up, then allow it to settle and cook gently until absorbed, stirring frequently.\\n\\n Stir in the spring onions.\\n\\n Cook over a low heat, stirring, for 2 minutes. Don’t allow the rice or vegetables to brown. Ladle about one quarter of the hot stock into the rice, then simmer gently until absorbed. It’s really important that you cook the rice slowly, so that it gradually becomes tender all the way through. And don’t be tempted to stir all the time – it’s not necessary and can break down the rice grains too much to give a stodgy texture.\\n\\n Keep ladling in the hot stock as soon as the last ladleful has been absorbed. From the time you start adding it, the rice will cook in 20-25 minutes.\\n\\n Add the asparagus spears when you’ve been cooking the rice for 12-15 minutes. It’s good if the asparagus just retains a little ‘bite’, though add earlier if the stalks are quite thick, or chop them into smaller pieces.\\n\\n Taste the rice from time to time to check when it’s tender. As soon as it is, add the grated Parmigiano Reggiano and stir it through.\\n\\n Share the risotto between 4 warm plates and serve topped with Parmigiano Reggiano shavings and basil leaves.\\n\\n Cook’s tips: Remember to always stir the risotto gently, not vigorously - it’s one of the secrets to its success. Make use of the rind from the Parmigiano Reggiano – if you add a chunk with the stock it will impart extra flavour to the risotto."
    }
  ]
}
